[
{"text": "Where do I start? Are trip was in May 2014 sorry couldn't select that above.", "title": "Can't say enough about this place", "reviewed": "Reviewed 8 August 2017 "},
{"text": "We had the most unbelievably amazing time here, with staff that couldn't do enough for us at all times. Our philosophy as a family is to always appreciate every experience that is on offer, and we the camp here had so much. Everything was outstanding. We took full advantage of the suggestions that were made by staff, from what to see, what to do, what massage to have and what food and drink to consume. One of our party is a vegetarian and she had as much choice at each mealtime as the rest of us. All to often we ended up envying her plate. One other member is a very fussy meat eater, and he ate extremely well too! Bob and the catering team were fabulous, game drive snacks and even birthday cake supplied with smiles . We felt like family and on leaving we sad to say goodbye.", "title": "Outstanding - if you have the chance you must go!", "reviewed": "Reviewed 4 August 2017 "},
{"text": "We are sitting on our deck wrapping up the final hours of our 4 night stay. We have stayed at 10 luxury safari lodges in South Africa, Rwanda, and Botswana and this is the finest we have stayed at. The setting is the best we have ever had. You look out over a valley with a river running through it and a hill rising in the background. Most afternoons, the landscape is filled with animals. Yesterday afternoon 2 giraffes paraded through the valley only a couple hundred meters away from us. Behind them, 4 elephants fed on grass along the river bank. A host of wildabeast and zebra also dotted the valley. While not seeing, we heard hippos in the background. That night as we slept, lions roared, both near and far.", "title": "Our finest game lodge experience", "reviewed": "Reviewed 2 August 2017 "},
{"text": "If this is your first safari, you may find this an amazing place. My wife and I have had the good fortune to visit a number of lodges, and our other experiences were definitely superior.", "title": "Not quite first class service...", "reviewed": "Reviewed 25 July 2017 "},
{"text": "I cannot say enough good about our experience at Mahali Mzuri. What I didn't realize before we arrived was there are only five luxury camps within the Conservancy; none of which is larger than 24 beds and all abide by environmentally friendly guidelines to construction, and operation in the Conservancy’s Code of Conduct. OLARE MOTOROGI CONSERVANCY has adopted a holistic approach to grazing and pasture management within the Conservancy; an approach that is based on traditional Maasia knowledge of the ecosystem. ", "title": "I Spent the First Day pinching Myself...", "reviewed": "Reviewed 9 July 2017 "},
{"text": "This trip was our honeymoon. I knew my wife had always wanted to go to South Africa, but when I discovered the 'Great Migration' happened to be occurring at exactly the time we would be on our Honeymoon I started looking for a destination in the Masai Mara for an unbelievable surprise for her! (She didn't even know we were going on Safari)", "title": "Honeymoon at Mahali", "reviewed": "Reviewed 18 April 2017 "},
{"text": "Where do I begin?", "title": "Such a beautiful experience!", "reviewed": "Reviewed 3 April 2017 "},
{"text": "First class camp with a stellar staff. Professional in every regard. A truly caring team of individuals that are focused on the client having the best possible experience. We felt at home as soon as we arrived. Our safari guide Dickson was excellent. A special shout out to Cosmos our waiter - the man is a true professional. Thank you for a great stay.", "title": "Perfect end to our Kenya safari", "reviewed": "Reviewed 28 March 2017 "},
{"text": "Mahali Mzuri safari camp lived up to our expectations. Had all the creature comforts we like but in an amazing tented accommodation. The staff were execellent and very caring and helpful. The food was to a very high standard and most of all, our one to one safari/game driver \"Levi' was outstanding. All in all, highly recommended in every department.", "title": "A Wonderful Safari Holiday", "reviewed": "Reviewed 2 March 2017 "},
{"text": "Looking at our unbelievable wedding photos today, I realized I never properly thanked the ENTIRE staff at Mahali Mzuri for making our wedding more than we could ever imagined. To my beautiful maid of honor Ann, to our warrior Jackson, the sweetest Johnstone and the best tracker ever, Levy and everyone that worked so hard to make our wedding special - Thank you! The entire staff and the village went above and beyond. And in addition, it all happened in the most magical place on Earth. The Mara is truly touched by God. And you could not wish for more lovely, welcoming or braver people. We have been on many other safaris - and you will see everything here except rhino - but the land here is like no other. The camp is beautiful and all you could ask for - but it's really far more special because of the people and the land and animals they love so much. And thank you Levy for never tiring in my constant request to go find elephants. :-). We promise to return soon! Thank you!", "title": "Unforgettable Wedding in the Most Special Place ", "reviewed": "Reviewed 25 February 2017 "}
]